In [67]:
import pandas as pd
import numpy as np

In [2]:
people = {
    'first': ['Ewa', 'Ula', 'Ala', 'Jan', 'Adam'],
    'last': ['Bąk', 'Kot', 'Duda', 'Kot', 'Kot'],
    'email': ['Ewa@o2.pl', 'Ula@o2.pl', 'Ala@o2.pl', 'JJ@example.com', 'adas@buziaczek.pl']
}

How to think about DataFrame:
    - DataFrame --> rows and columns 
    - Series --> rows of a single column

In [3]:
df = pd.DataFrame(people)
df

  first  last              email
0   Ewa   Bąk          Ewa@o2.pl
1   Ula   Kot          Ula@o2.pl
2   Ala  Duda          Ala@o2.pl
3   Jan   Kot     JJ@example.com
4  Adam   Kot  adas@buziaczek.pl

In [4]:
df['email']

0            Ewa@o2.pl
1            Ula@o2.pl
2            Ala@o2.pl
3       JJ@example.com
4    adas@buziaczek.pl
Name: email, dtype: object

In [5]:
type(df['email'])

pandas.core.series.Series

In [6]:
df[['last', 'email']]

   last              email
0   Bąk          Ewa@o2.pl
1   Kot          Ula@o2.pl
2  Duda          Ala@o2.pl
3   Kot     JJ@example.com
4   Kot  adas@buziaczek.pl

In [7]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

# Indexes - How to Set, Reset, and Use Indexes

# iloc --> search by integer location

In [8]:
df.iloc[[0, 2]]

  first  last      email
0   Ewa   Bąk  Ewa@o2.pl
2   Ala  Duda  Ala@o2.pl

In [9]:
df.iloc[[0, 2], 2]

0    Ewa@o2.pl
2    Ala@o2.pl
Name: email, dtype: object

# loc --> search by label
# When talking about labels for rows these will be the indexes.

In [10]:
df

  first  last              email
0   Ewa   Bąk          Ewa@o2.pl
1   Ula   Kot          Ula@o2.pl
2   Ala  Duda          Ala@o2.pl
3   Jan   Kot     JJ@example.com
4  Adam   Kot  adas@buziaczek.pl

In [11]:
df.loc[0]

first          Ewa
last           Bąk
email    Ewa@o2.pl
Name: 0, dtype: object

In [12]:
df.loc[[0, 2]]

  first  last      email
0   Ewa   Bąk  Ewa@o2.pl
2   Ala  Duda  Ala@o2.pl

In [13]:
df.loc[[0, 2], ['email', 'last']]

       email  last
0  Ewa@o2.pl   Bąk
2  Ala@o2.pl  Duda

In [14]:
df['email']

0            Ewa@o2.pl
1            Ula@o2.pl
2            Ala@o2.pl
3       JJ@example.com
4    adas@buziaczek.pl
Name: email, dtype: object

In [15]:
df.set_index('email', inplace=True)

In [16]:
df

                  first  last
email
Ewa@o2.pl           Ewa   Bąk
Ula@o2.pl           Ula   Kot
Ala@o2.pl           Ala  Duda
JJ@example.com      Jan   Kot
adas@buziaczek.pl  Adam   Kot

In [17]:
df.index

Index(['Ewa@o2.pl', 'Ula@o2.pl', 'Ala@o2.pl', 'JJ@example.com',
       'adas@buziaczek.pl'],
      dtype='object', name='email')

In [18]:
df.loc['Ewa@o2.pl', 'last']

'Bąk'

In [19]:
df.iloc[0]

first    Ewa
last     Bąk
Name: Ewa@o2.pl, dtype: object

In [20]:
df.reset_index(inplace=True)
df

               email first  last
0          Ewa@o2.pl   Ewa   Bąk
1          Ula@o2.pl   Ula   Kot
2          Ala@o2.pl   Ala  Duda
3     JJ@example.com   Jan   Kot
4  adas@buziaczek.pl  Adam   Kot

# Filtering - Using Conditionals to Filter Rows and Columns

In [21]:
df['last'] == 'Kot'

0    False
1     True
2    False
3     True
4     True
Name: last, dtype: bool

In [22]:
filt = (df['last'] == 'Kot') & (df['first'] == 'Jan')
df.loc[filt]

            email first last
3  JJ@example.com   Jan  Kot

In [23]:
df.loc[filt, ['email']]

            email
3  JJ@example.com

In [24]:
filt_2 = (df['last'] == 'Bąk') | (df['first'] == 'Jan')
df.loc[filt_2]

            email first last
0       Ewa@o2.pl   Ewa  Bąk
3  JJ@example.com   Jan  Kot

# Negate a filter with tilda ~

In [25]:
df.loc[~filt, ['email']]

               email
0          Ewa@o2.pl
1          Ula@o2.pl
2          Ala@o2.pl
4  adas@buziaczek.pl

# Updating Rows and Columns - Modifying Data Within DataFrames

In [26]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [27]:
df.columns = ['email', 'first_name', 'last_name']
df.columns

Index(['email', 'first_name', 'last_name'], dtype='object')

In [28]:
df.columns = [c.lower() for c in df.columns]
df

               email first_name last_name
0          Ewa@o2.pl        Ewa       Bąk
1          Ula@o2.pl        Ula       Kot
2          Ala@o2.pl        Ala      Duda
3     JJ@example.com        Jan       Kot
4  adas@buziaczek.pl       Adam       Kot

In [29]:
df.columns = df.columns.str.replace(' ', '_')
df

               email first_name last_name
0          Ewa@o2.pl        Ewa       Bąk
1          Ula@o2.pl        Ula       Kot
2          Ala@o2.pl        Ala      Duda
3     JJ@example.com        Jan       Kot
4  adas@buziaczek.pl       Adam       Kot

In [30]:
df.rename(columns={
    'first_name': 'first',
    'last_name': 'last',
}, inplace=True)
df

               email first  last
0          Ewa@o2.pl   Ewa   Bąk
1          Ula@o2.pl   Ula   Kot
2          Ala@o2.pl   Ala  Duda
3     JJ@example.com   Jan   Kot
4  adas@buziaczek.pl  Adam   Kot

In [31]:
df.loc[2]

email    Ala@o2.pl
first          Ala
last          Duda
Name: 2, dtype: object

In [32]:
df.loc[2, ['last', 'email']] = ['Dudek', 'a-dudek@op.pl']
df

               email first   last
0          Ewa@o2.pl   Ewa    Bąk
1          Ula@o2.pl   Ula    Kot
2      a-dudek@op.pl   Ala  Dudek
3     JJ@example.com   Jan    Kot
4  adas@buziaczek.pl  Adam    Kot

In [33]:
df.loc[2, 'first'] = 'Alan'
df

               email first   last
0          Ewa@o2.pl   Ewa    Bąk
1          Ula@o2.pl   Ula    Kot
2      a-dudek@op.pl  Alan  Dudek
3     JJ@example.com   Jan    Kot
4  adas@buziaczek.pl  Adam    Kot

In [34]:
df.at[2, 'first'] = 'Alicja'
df

               email   first   last
0          Ewa@o2.pl     Ewa    Bąk
1          Ula@o2.pl     Ula    Kot
2      a-dudek@op.pl  Alicja  Dudek
3     JJ@example.com     Jan    Kot
4  adas@buziaczek.pl    Adam    Kot

In [35]:
df

               email   first   last
0          Ewa@o2.pl     Ewa    Bąk
1          Ula@o2.pl     Ula    Kot
2      a-dudek@op.pl  Alicja  Dudek
3     JJ@example.com     Jan    Kot
4  adas@buziaczek.pl    Adam    Kot

In [36]:
filt = (df['email'] == 'Ewa@o2.pl')
df.loc[filt, 'last'] = 'Szmidt'
df

               email   first    last
0          Ewa@o2.pl     Ewa  Szmidt
1          Ula@o2.pl     Ula     Kot
2      a-dudek@op.pl  Alicja   Dudek
3     JJ@example.com     Jan     Kot
4  adas@buziaczek.pl    Adam     Kot

In [37]:
df['email'] = df['email'].str.lower()
df

               email   first    last
0          ewa@o2.pl     Ewa  Szmidt
1          ula@o2.pl     Ula     Kot
2      a-dudek@op.pl  Alicja   Dudek
3     jj@example.com     Jan     Kot
4  adas@buziaczek.pl    Adam     Kot

# apply --> is used for calling a function on our values.
    1. Series

In [38]:
df['email'].apply(len)

0     9
1     9
2    13
3    14
4    17
Name: email, dtype: int64

In [39]:
def update_email(email):
    return email.upper()

In [40]:
df['email'] = df['email'].apply(update_email)
df

               email   first    last
0          EWA@O2.PL     Ewa  Szmidt
1          ULA@O2.PL     Ula     Kot
2      A-DUDEK@OP.PL  Alicja   Dudek
3     JJ@EXAMPLE.COM     Jan     Kot
4  ADAS@BUZIACZEK.PL    Adam     Kot

In [41]:
df['email'] = df['email'].apply(lambda x: x.lower())
df

               email   first    last
0          ewa@o2.pl     Ewa  Szmidt
1          ula@o2.pl     Ula     Kot
2      a-dudek@op.pl  Alicja   Dudek
3     jj@example.com     Jan     Kot
4  adas@buziaczek.pl    Adam     Kot

    2.DataFrames

In [42]:
df.apply(len)

email    5
first    5
last     5
dtype: int64

In [43]:
df.apply(len, 'columns')

0    3
1    3
2    3
3    3
4    3
dtype: int64

In [44]:
df.apply(pd.Series.min)

email    a-dudek@op.pl
first             Adam
last             Dudek
dtype: object

In [45]:
df.apply(lambda s: s.min())

email    a-dudek@op.pl
first             Adam
last             Dudek
dtype: object

In [46]:
df.applymap(len)

   email  first  last
0      9      3     6
1      9      3     3
2     13      6     5
3     14      3     3
4     17      4     3

In [47]:
df.applymap(str.lower)

               email   first    last
0          ewa@o2.pl     ewa  szmidt
1          ula@o2.pl     ula     kot
2      a-dudek@op.pl  alicja   dudek
3     jj@example.com     jan     kot
4  adas@buziaczek.pl    adam     kot

    -map method only works on series. map is used for substituting each value in a series with another value.

In [48]:
df['first'].map({
    'Ewa': 'ewelina',
    'Ula': 'maria',
})

0    ewelina
1      maria
2        NaN
3        NaN
4        NaN
Name: first, dtype: object

In [49]:
df['first'].replace({
    'Ewa': 'ewelina',
    'Ula': 'maria',
})

0    ewelina
1      maria
2     Alicja
3        Jan
4       Adam
Name: first, dtype: object

# Add/Remove Rows and Columns From DataFrames

In [50]:
df['first'] + ' ' + df['last']

0      Ewa Szmidt
1         Ula Kot
2    Alicja Dudek
3         Jan Kot
4        Adam Kot
dtype: object

In [51]:
df['full_name'] = df['first'] + ' ' + df['last']
df

               email   first    last     full_name
0          ewa@o2.pl     Ewa  Szmidt    Ewa Szmidt
1          ula@o2.pl     Ula     Kot       Ula Kot
2      a-dudek@op.pl  Alicja   Dudek  Alicja Dudek
3     jj@example.com     Jan     Kot       Jan Kot
4  adas@buziaczek.pl    Adam     Kot      Adam Kot

In [52]:
df.drop(columns=['first', 'last'], inplace=True)
df

               email     full_name
0          ewa@o2.pl    Ewa Szmidt
1          ula@o2.pl       Ula Kot
2      a-dudek@op.pl  Alicja Dudek
3     jj@example.com       Jan Kot
4  adas@buziaczek.pl      Adam Kot

In [53]:
df['full_name'].str.split(' ')

0      [Ewa, Szmidt]
1         [Ula, Kot]
2    [Alicja, Dudek]
3         [Jan, Kot]
4        [Adam, Kot]
Name: full_name, dtype: object

In [54]:
df['full_name'].str.split(' ', expand=True)

        0       1
0     Ewa  Szmidt
1     Ula     Kot
2  Alicja   Dudek
3     Jan     Kot
4    Adam     Kot

In [55]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)
df

               email     full_name   first    last
0          ewa@o2.pl    Ewa Szmidt     Ewa  Szmidt
1          ula@o2.pl       Ula Kot     Ula     Kot
2      a-dudek@op.pl  Alicja Dudek  Alicja   Dudek
3     jj@example.com       Jan Kot     Jan     Kot
4  adas@buziaczek.pl      Adam Kot    Adam     Kot

In [56]:
df.append({'first': 'Tomek'}, ignore_index=True)

               email     full_name   first    last
0          ewa@o2.pl    Ewa Szmidt     Ewa  Szmidt
1          ula@o2.pl       Ula Kot     Ula     Kot
2      a-dudek@op.pl  Alicja Dudek  Alicja   Dudek
3     jj@example.com       Jan Kot     Jan     Kot
4  adas@buziaczek.pl      Adam Kot    Adam     Kot
5                NaN           NaN   Tomek     NaN

In [57]:
people = {
    'first': ['Tomek', 'Szczepan'],
    'last': ['Pesto', 'Nowak'],
    'email': ['Pesto@o2.pl', 'Szczepek@o2.pl']
}
df2 = pd.DataFrame(people)
df2

      first   last           email
0     Tomek  Pesto     Pesto@o2.pl
1  Szczepan  Nowak  Szczepek@o2.pl

In [58]:
df = df.append(df2, ignore_index=True)
df

               email     full_name     first    last
0          ewa@o2.pl    Ewa Szmidt       Ewa  Szmidt
1          ula@o2.pl       Ula Kot       Ula     Kot
2      a-dudek@op.pl  Alicja Dudek    Alicja   Dudek
3     jj@example.com       Jan Kot       Jan     Kot
4  adas@buziaczek.pl      Adam Kot      Adam     Kot
5        Pesto@o2.pl           NaN     Tomek   Pesto
6     Szczepek@o2.pl           NaN  Szczepan   Nowak

In [59]:
df = df.drop(index=5)
df

               email     full_name     first    last
0          ewa@o2.pl    Ewa Szmidt       Ewa  Szmidt
1          ula@o2.pl       Ula Kot       Ula     Kot
2      a-dudek@op.pl  Alicja Dudek    Alicja   Dudek
3     jj@example.com       Jan Kot       Jan     Kot
4  adas@buziaczek.pl      Adam Kot      Adam     Kot
6     Szczepek@o2.pl           NaN  Szczepan   Nowak

In [60]:
filt = df['last'] == 'Kot'
df.drop(index=df[filt].index)

            email     full_name     first    last
0       ewa@o2.pl    Ewa Szmidt       Ewa  Szmidt
2   a-dudek@op.pl  Alicja Dudek    Alicja   Dudek
6  Szczepek@o2.pl           NaN  Szczepan   Nowak

# Sorting Data

In [61]:
df.sort_values(by='last')

               email     full_name     first    last
2      a-dudek@op.pl  Alicja Dudek    Alicja   Dudek
1          ula@o2.pl       Ula Kot       Ula     Kot
3     jj@example.com       Jan Kot       Jan     Kot
4  adas@buziaczek.pl      Adam Kot      Adam     Kot
6     Szczepek@o2.pl           NaN  Szczepan   Nowak
0          ewa@o2.pl    Ewa Szmidt       Ewa  Szmidt

In [62]:
df.sort_values(by=['last', 'first'], ascending=False)

               email     full_name     first    last
0          ewa@o2.pl    Ewa Szmidt       Ewa  Szmidt
6     Szczepek@o2.pl           NaN  Szczepan   Nowak
1          ula@o2.pl       Ula Kot       Ula     Kot
3     jj@example.com       Jan Kot       Jan     Kot
4  adas@buziaczek.pl      Adam Kot      Adam     Kot
2      a-dudek@op.pl  Alicja Dudek    Alicja   Dudek

In [64]:
df.sort_values(by=['last', 'first'], ascending=[False, True], inplace=True)
df

               email     full_name     first    last
0          ewa@o2.pl    Ewa Szmidt       Ewa  Szmidt
6     Szczepek@o2.pl           NaN  Szczepan   Nowak
4  adas@buziaczek.pl      Adam Kot      Adam     Kot
3     jj@example.com       Jan Kot       Jan     Kot
1          ula@o2.pl       Ula Kot       Ula     Kot
2      a-dudek@op.pl  Alicja Dudek    Alicja   Dudek

In [65]:
df.sort_index()

               email     full_name     first    last
0          ewa@o2.pl    Ewa Szmidt       Ewa  Szmidt
1          ula@o2.pl       Ula Kot       Ula     Kot
2      a-dudek@op.pl  Alicja Dudek    Alicja   Dudek
3     jj@example.com       Jan Kot       Jan     Kot
4  adas@buziaczek.pl      Adam Kot      Adam     Kot
6     Szczepek@o2.pl           NaN  Szczepan   Nowak

In [66]:
df['last'].sort_values()

2     Dudek
4       Kot
3       Kot
1       Kot
6     Nowak
0    Szmidt
Name: last, dtype: object

# Grouping and Aggregating - Analyzing and Exploring Your Data

# Cleaning Data - Casting Datatypes and Handling Missing Values

In [82]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [83]:
df = pd.DataFrame(people)
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [84]:
df.dropna(axis='index', how='any')

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [85]:
df.dropna(axis='index', how='all', subset=['email'])

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [86]:
df.dropna(axis='index', how='all')

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [87]:
df.dropna(axis='columns', how='all')

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [88]:
df.dropna(axis='index', how='all', subset=['last', 'email'])

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [89]:
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [90]:
df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [91]:
df.dropna()

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63

In [92]:
df.dropna(axis='index', how='all', subset=['last', 'email'])

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
5   None      NaN      Anonymous@email.com  None

In [93]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [95]:
df.fillna('0')

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63
3  Chris  Schafer                        0  36
4      0        0                        0   0
5      0        0      Anonymous@email.com   0
6      0        0                        0   0

In [96]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [97]:
type(np.nan)

float

In [99]:
df['age'] = df['age'].astype(float)
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [102]:
print(f"mean: {df['age'].mean()}")
print(f"median: {df['age'].median()}")

mean: 46.75
median: 45.5